{
  "case": "g10",
  "stories": [
    {
      "identifier": "g10_0",
      "text": "As a site member, I want to describe myself on my own page in a semi-structured way, so that others can learn about me.",
      "entities": [
        "Page",
        "Structured Way"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Describe On Own Page In A Structured Way"
      ]
    },
    {
      "identifier": "g10_1",
      "text": "As a site member, I want to fill out an application to become a Certified Scrum Practitioner, so that I can earn that designation.",
      "entities": [
        "Application"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Fill Out An To Application A Certified Scrum Practitioner"
      ]
    },
    {
      "identifier": "g10_2",
      "text": "As a Practitioner, I want to include additional details about me in my profile page, so that I can showcase my experience.",
      "entities": [
        "Additional Detail",
        "Profile Page"
      ],
      "personas": [
        "Practitioner"
      ],
      "actions": [
        "Include Additional Details About In Profile Page"
      ]
    },
    {
      "identifier": "g10_3",
      "text": "As a site member, I want to fill out an application to become a Certified Scrum Trainer, so that I can teach CSM and CSPO courses and certify others.",
      "entities": [
        "Application"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Fill Out An To Application A Certified Scrum Trainer"
      ]
    },
    {
      "identifier": "g10_4",
      "text": "As a Trainer, I want to include additional details in my profile page about me, so that others can learn about me and decide if I am the right trainer for them.",
      "entities": [
        "Additional Detail",
        "Page",
        "Profile"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Include Additional Details In Page Profile Page About"
      ]
    },
    {
      "identifier": "g10_5",
      "text": "As a Practitioner, I want to write an article for the site with a small graphic shown with the article showing my CSP or CST status, so that others know my certifications when reading.",
      "entities": [
        "Cst",
        "Site",
        "Small Graphic",
        "Article",
        "Csp Status"
      ],
      "personas": [
        "Practitioner"
      ],
      "actions": [
        "Show Cst",
        "Write An Article For The Site With A Small Graphic With",
        "Show Csp Status",
        "Show"
      ]
    },
    {
      "identifier": "g10_6",
      "text": "As a trainer, I want to list my upcoming classes in my profile and include a link to a detailed page about each, so that prospective attendees can find my courses.",
      "entities": [
        "Link",
        "Upcome Class",
        "Profile",
        "Detailed Page"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Include A Link To A Detailed Page About Each",
        "List Upcoming Classes In Profile"
      ]
    },
    {
      "identifier": "g10_7",
      "text": "As a site member, I want to view the profiles of other members, so that I can find others I might want to connect with.",
      "entities": [
        "Member"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "View The Profiles Of Other Members"
      ]
    },
    {
      "identifier": "g10_8",
      "text": "As a site member, I want to search for profiles based on a few fields, so that I can find others I might want to connect with.",
      "entities": [
        "Profile",
        "Field"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Search For Profiles On A Few Fields"
      ]
    },
    {
      "identifier": "g10_9",
      "text": "As a site member, I want to mark my profile as private in which case only my name will appear, so that no one can learn things about me I don't want shared.",
      "entities": [
        "Profile"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Which Case Name Appear",
        "Private Mark Profile"
      ]
    },
    {
      "identifier": "g10_10",
      "text": "As a site member, I want to mark my email address as private even if the rest of my profile is not, so that no one can contact me.",
      "entities": [
        "Email Address"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Private Mark Email Address"
      ]
    },
    {
      "identifier": "g10_11",
      "text": "As a site member, I want to send an email to any member via a form, so that we can connect.",
      "entities": [
        "Member",
        "Form",
        "Email"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Send An Email To Any Member Via A Form"
      ]
    },
    {
      "identifier": "g10_12",
      "text": "As a site administrator, I want to read practicing and training applications and approve or reject them, so that only applicants who qualify can become CSPs or CSTs.",
      "entities": [
        "Practice Application",
        "Training"
      ],
      "personas": [
        "Site Administrator"
      ],
      "actions": [
        "Read Practicing Applications",
        "Read Training",
        "Approve",
        "Reject Training",
        "Reject Practicing Applications"
      ]
    },
    {
      "identifier": "g10_13",
      "text": "As a site administrator, I want to edit any site member profile, so that I can correct problems for members.",
      "entities": [
        "Site Member Profile"
      ],
      "personas": [
        "Site Administrator"
      ],
      "actions": [
        "Edit Any Site Member Profile"
      ]
    },
    {
      "identifier": "g10_14",
      "text": "As a site visitor, I want to read current news on the home page, so that I stay current on agile news.",
      "entities": [
        "Home Page",
        "Current News"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Read Current News On The Home Page"
      ]
    },
    {
      "identifier": "g10_15",
      "text": "As a site visitor, I want to access old news that is no longer on the home page, so that I can access things I remember from the past or that others mention to me.",
      "entities": [
        "Old News",
        "Home Page"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Access Old News Longer Is No On The Home Page"
      ]
    },
    {
      "identifier": "g10_16",
      "text": "As a site visitor, I want to email news items to the editor, so that they can be considered for publication.",
      "entities": [
        "News Items",
        "Editor"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Email News Items To The Editor"
      ]
    },
    {
      "identifier": "g10_17",
      "text": "As a site editor, I want to set the following dates on a news item: Start Publishing Date, Old News Date, Stop Publishing Date, so that articles are published on and through appropriate dates.",
      "entities": [
        "Follow Date",
        "News Item",
        "Date",
        "News"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Publishing Date Old News Date",
        "Set The Following Dates On A News Item",
        "Publishing Date"
      ]
    },
    {
      "identifier": "g10_18",
      "text": "As a site member, I want to subscribe to an RSS feed of news, so that I remain sufficiently and easily informed.",
      "entities": [
        "News",
        "Rss Feed"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Subscribe To An Rss Feed Of News"
      ]
    },
    {
      "identifier": "g10_19",
      "text": "As a site editor, I want to assign priority numbers to news items, so that I can indicate which articles I want featured most prominently on the site.",
      "entities": [
        "News Items",
        "Priority Numbers"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Assign Priority Numbers To News Items"
      ]
    },
    {
      "identifier": "g10_20",
      "text": "As a site visitor, I want to see a list of all upcoming Certification Courses and can page through them if there are a lot, so that I can choose the best course for me.",
      "entities": [
        "Certification Courses"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "See A List Of All Upcoming Certification Courses"
      ]
    },
    {
      "identifier": "g10_21",
      "text": "As a site visitor, I want to see a list of all upcoming Other Courses and can page through them if necessary, so that I can choose the best course for me.",
      "entities": [
        "Course"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "See A List Of",
        "Page Through A List Of All Upcoming Other Courses",
        "Upcome Other Courses"
      ]
    },
    {
      "identifier": "g10_22",
      "text": "As a site visitor, I want to see a list of all upcoming Events, so that I can decide if I want to attend any.",
      "entities": [
        "Upcome Event"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "See A List Of All Upcoming Events"
      ]
    },
    {
      "identifier": "g10_23",
      "text": "As a trainer, I want to create a new course or event, so that site visitors can see it.",
      "entities": [
        "Event",
        "New Course"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Create Event",
        "Create A New Course"
      ]
    },
    {
      "identifier": "g10_24",
      "text": "As a trainer, I want to create an Other Course or Event I am charged a listing fee for that activity, so that I don't list events I don't really intend to hold.",
      "entities": [
        "Listing Fee",
        "Event",
        "Activity",
        "Course"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Create An Other Course",
        "Create Event",
        "Charged A Listing Fee For That Activity"
      ]
    },
    {
      "identifier": "g10_25",
      "text": "As a site administrator, I want to create an Other Course or Event that is not charged a listing fee, so that the Scrum Alliance doesn't charge itself for Scrum Gatherings that it puts on.",
      "entities": [
        "Event",
        "Course",
        "Listing Fee"
      ],
      "personas": [
        "Site Administrator"
      ],
      "actions": [
        "Create An Other Course Not Charged A Listing Fee",
        "Create Event"
      ]
    },
    {
      "identifier": "g10_26",
      "text": "As a site administrator, I want to set the listing fee per Other Course or Event, so that we have flexibility on what to charge in the future.",
      "entities": [
        "Event",
        "Fee",
        "Course",
        "Listing"
      ],
      "personas": [
        "Site Administrator"
      ],
      "actions": [
        "Set The Fee Per Event",
        "Set The Listing Fee Per Other Course"
      ]
    },
    {
      "identifier": "g10_27",
      "text": "As a trainer, I want to update one of my existing courses or events, so that it reflects accurate information.",
      "entities": [
        "Exist Course",
        "Event"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Update One Of Existing Courses",
        "Update One Of Event"
      ]
    },
    {
      "identifier": "g10_28",
      "text": "As a trainer, I want to delete one of my courses or events, so that it's no longer listed if I cancel for some reason.",
      "entities": [
        "Event",
        "Course"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Delete One Of Courses",
        "Delete One Of Event"
      ]
    },
    {
      "identifier": "g10_29",
      "text": "As a trainer, I want to copy one of my courses or events, so that I can create a new one.",
      "entities": [
        "Course",
        "Event"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Copy One Of Courses",
        "Copy One Of Event"
      ]
    },
    {
      "identifier": "g10_30",
      "text": "As a site admin, I want to delete any course or event, so that I can remove things that will no longer occur.",
      "entities": [
        "Course",
        "Event"
      ],
      "personas": [
        "Site Admin"
      ],
      "actions": [
        "Delete Event",
        "Delete Any Course"
      ]
    },
    {
      "identifier": "g10_31",
      "text": "As a site editor, I want to update any course or event, so that I can fix things the original author hasn't.",
      "entities": [
        "Event",
        "Course"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Update Any Course",
        "Update Event"
      ]
    },
    {
      "identifier": "g10_32",
      "text": "As a trainer, I want to turn a course into an event or an event into a course, so that I can correctly classify anything that was entered incorrectly.",
      "entities": [
        "Event",
        "Course"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Turn A Course Into An Event"
      ]
    },
    {
      "identifier": "g10_33",
      "text": "As a site visitor, I want to have an advanced search option that lets me fill in a form of search criteria, so that I can quickly find what I am looking for.",
      "entities": [
        "Search Criteria",
        "Search Option"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Have An Advanced Search Option Lets Fill A Form Of Search Criteria"
      ]
    },
    {
      "identifier": "g10_34",
      "text": "As a site visitor, I want to view a course I can click on the trainer's name and be taken to the trainer's profile, so that I can read more about a trainer before registering for a course.",
      "entities": [
        "Profile",
        "Trainer",
        "Course"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "View A Course",
        "Taken Click On The Trainer's Name To The Trainer's Profile"
      ]
    },
    {
      "identifier": "g10_35",
      "text": "As a site visitor, I want to subscribe to an RSS feed of upcoming courses and events, so that I am up to day without having to visit the site.",
      "entities": [
        "Course",
        "Event",
        "Feed",
        "Rss"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Subscribe To An Feed Upcoming Event",
        "Subscribe To An Rss Feed Upcoming Courses"
      ]
    },
    {
      "identifier": "g10_36",
      "text": "As a site visitor, I want to read FAQs, so that I can get quick answers.",
      "entities": [
        "Faq"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Read Faqs"
      ]
    },
    {
      "identifier": "g10_37",
      "text": "As a site editor, I want to maintain a FAQ section, so that support gets fewer easily answered questions.",
      "entities": [
        "Faq Section"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Maintain A Faq Section"
      ]
    },
    {
      "identifier": "g10_38",
      "text": "As a site visitor, I want to do a full-text search of the FAQs, so that I can find an answer quickly.",
      "entities": [
        "Faq",
        "Text Search"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Do A Full Text Search Of The Faqs"
      ]
    },
    {
      "identifier": "g10_39",
      "text": "As a site member, I want to download the latest training material and methodology PDFs, so that I have them.",
      "entities": [
        "Pdf",
        "Training Material"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Methodology The Latest Training Material Pdfs"
      ]
    },
    {
      "identifier": "g10_40",
      "text": "As a visitor, I want to download presentations, PDFs, etc. on Scrum, so that I can learn from them or use them.",
      "entities": [
        "Presentation",
        "Scrum"
      ],
      "personas": [
        "Visitor"
      ],
      "actions": [
        "Etc, Pdfs Download Presentations"
      ]
    },
    {
      "identifier": "g10_41",
      "text": "As a site member, I want to scroll through a listing of jobs, so that I can see if there any I am interested in.",
      "entities": [
        "Job"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Scroll Through A Listing Of Jobs"
      ]
    },
    {
      "identifier": "g10_42",
      "text": "As a recruiter, I want to post a help wanted ad, so that I can attract candidates.",
      "entities": [
        "Ad"
      ],
      "personas": [
        "Recruiter"
      ],
      "actions": [
        "Want Ad",
        "Post"
      ]
    },
    {
      "identifier": "g10_43",
      "text": "As a site admin, I want to approve each help wanted ad before it gets to the site, so that we're sure of the quality of jobs being listed.",
      "entities": [
        "Help",
        "Ad"
      ],
      "personas": [
        "Site Admin"
      ],
      "actions": [
        "Approve Each Help"
      ]
    },
    {
      "identifier": "g10_45",
      "text": "As a site member, I want to subscribe to an RSS feed of jobs available, so that I can read them without visiting the site.",
      "entities": [
        "Job",
        "Rss Feed"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Subscribe To An Rss Feed Of Jobs"
      ]
    },
    {
      "identifier": "g10_46",
      "text": "As a site admin, I want to edit and delete help wanted ads, so that I can correct small problems or make sure each ad complies with site guidelines.",
      "entities": [
        "Ad",
        "Delete Help"
      ],
      "personas": [
        "Site Admin"
      ],
      "actions": [
        "Wanted Edit Delete Help Ads"
      ]
    },
    {
      "identifier": "g10_47",
      "text": "As a site admin, I want to stop publishing jobs on the site 30 days after being posted, so that jobs that may have been filled aren't still listed when the hiring party forgets to come back and delete the ad.",
      "entities": [
        "Job",
        "Site"
      ],
      "personas": [
        "Site Admin"
      ],
      "actions": [
        "Publishing Jobs On The Site",
        "Days Stop Posted"
      ]
    },
    {
      "identifier": "g10_48",
      "text": "As a recruiter, I want to be able to extend an ad for another 30 days by visiting the site and updating the posting, so that my ad remains active.",
      "entities": [
        "Ad",
        "Day",
        "Posting",
        "Site"
      ],
      "personas": [
        "Recruiter"
      ],
      "actions": [
        "Extend An Ad For Another Days",
        "Update The Posting",
        "Extend An Ad For Another Days Visiting The Site"
      ]
    },
    {
      "identifier": "g10_50",
      "text": "As a site visitor, I want to read a new article on the front page about once a week, so that I am up on all the latest happenings.",
      "entities": [
        "New Article",
        "Page"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Read A New Article On The Front Page A Week Once"
      ]
    },
    {
      "identifier": "g10_51",
      "text": "As the site editor, I want to include a teaser with each article, so that site visitors can decide if they want to read the rest.",
      "entities": [
        "Teaser",
        "Article"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Include A Teaser With Each Article"
      ]
    },
    {
      "identifier": "g10_52",
      "text": "As a site member who has read a teaser on the front page, I want to read the entire article so that I can finish articles that appeal to me.",
      "entities": [
        "Entire Article"
      ],
      "personas": [
        "Teaser",
        "Page",
        "Site Member"
      ],
      "actions": [
        "Read The Entire Article"
      ]
    },
    {
      "identifier": "g10_53",
      "text": "As the site editor, I want to add an article to the site, so that the site has plenty of content.",
      "entities": [
        "Article",
        "Site"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Add An Article To The Site"
      ]
    },
    {
      "identifier": "g10_54",
      "text": "As a site editor, I want to set start publishing dates, old article date, and stop publishing dates for articles, so that articles appear only during appropriate periods.",
      "entities": [
        "Start Publishing Dates",
        "Article",
        "Date"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Set Old Article Date",
        "Set Start Publishing Dates",
        "Stop",
        "Publishing Dates For Articles"
      ]
    },
    {
      "identifier": "g10_56",
      "text": "As the site editor, I want to have pretty good control over how the article, so that articles are visually appealing.",
      "entities": [
        "Good Control",
        "Article"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Have Pretty Good Control Over How The Article"
      ]
    },
    {
      "identifier": "g10_57",
      "text": "As a site visitor, I want to click the link from the article teaser to take me directly to the body of the article. not to another teaser setup, so that I can easily finish the article.",
      "entities": [
        "Link",
        "Article"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Click The Link From The Article Teaser",
        "The Link Take To The Body Of The Article"
      ]
    },
    {
      "identifier": "g10_58",
      "text": "As a site editor, I want to be able to indicate whether an article is publicly available or for members only, so that visitors are incentivized to become members.",
      "entities": [
        "Member",
        "Article"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "For Indicate An Article Only Members"
      ]
    },
    {
      "identifier": "g10_59",
      "text": "As a site visitor, I want to be able to read some of your articles, so that I can learn without first joining the site.",
      "entities": [
        "Article"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Read Some Of Articles"
      ]
    },
    {
      "identifier": "g10_60",
      "text": "As a site member, I want to have full access to all articles, so that there is a benefit to being a member.",
      "entities": [
        "Article",
        "Access"
      ],
      "personas": [
        "Site Member"
      ],
      "actions": [
        "Have Full Access To All Articles"
      ]
    },
    {
      "identifier": "g10_61",
      "text": "As a site visitor, I want to do a full-text search of article body, title, and author name, so that I can find what I want.",
      "entities": [
        "Search",
        "Title",
        "Article Body",
        "Author Name",
        "Text Search"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Do A Full Search Of Title",
        "Do A Full Search Of Author Name",
        "Do A Full Text Search Of Article Body"
      ]
    },
    {
      "identifier": "g10_62",
      "text": "As a site visitor, I want to subscribe to an RSS feed of articles, so that I can read them without visiting the site.",
      "entities": [
        "Article",
        "Rss Feed"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Subscribe To An Rss Feed Of Articles"
      ]
    },
    {
      "identifier": "g10_63",
      "text": "As a site visitor, I want to post comments about articles, so that others can read them.",
      "entities": [
        "Comment",
        "Article"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Post Comments About Articles"
      ]
    },
    {
      "identifier": "g10_64",
      "text": "As a site editor, I want to have a prominent area on the home page where I can put special announcements not necessarily news or articles, so that I can give them additional exposure.",
      "entities": [
        "Special Announcement",
        "Home Page",
        "Article",
        "Prominent Area"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Have A Prominent Area On The Home Page Not",
        "Put Special Announcements",
        "Put Special Announcements Article"
      ]
    },
    {
      "identifier": "g10_65",
      "text": "As a site editor, I want to have some flexibility as to where things appear, so that I can accommodate different types of content.",
      "entities": [
        "Thing",
        "Flexibility"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Have Some Flexibility Things Where Appear"
      ]
    },
    {
      "identifier": "g10_66",
      "text": "As a trainer, I want to see the upcoming courses are what I want visitors to notice, so that they register and there's a benefit to my membership.",
      "entities": [
        "Upcome Course"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "What Notice",
        "See"
      ]
    },
    {
      "identifier": "g10_67",
      "text": "As a site visitor, I want to see new content when I come to the site, so that I come back more often.",
      "entities": [
        "New Content",
        "Site"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Come To The Site",
        "See New Content"
      ]
    },
    {
      "identifier": "g10_68",
      "text": "As a site visitor, I want to have articles that interest me and are easy to get to, so that I come to the site for my agile news and learning.",
      "entities": [
        "Article"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Have Articles Interest",
        "Get",
        "Have Articles",
        "Be"
      ]
    },
    {
      "identifier": "g10_69",
      "text": "As a site visitor, I want to know as soon as I visit what on earth Scrum is and why it needs an alliance, so that I don't bounce immediately o? the page.",
      "entities": [
        "Alliance"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Visit",
        "Know"
      ]
    },
    {
      "identifier": "g10_70",
      "text": "As a site visitor, I want to know at a glance around the home page what on earth a CSM is and why I'd want to be one, so that I read more.",
      "entities": [
        "Earth",
        "Home Page",
        "Glance",
        "Csm"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Know At A Glance Around The Home Page",
        "Be One"
      ]
    },
    {
      "identifier": "g10_71",
      "text": "As a site visitor, I want to be able to get back to the home page quickly and easily, so that I don't get lost navigating.",
      "entities": [
        "Home Page"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "Easily Get To The Home Page"
      ]
    },
    {
      "identifier": "g10_72",
      "text": "As a site visitor, I want to see a list of the most popular items on the site, so that I am most likely to read the most important or best content.",
      "entities": [
        "Popular Item",
        "Site"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "See A List Of The Most Popular Items On The Site"
      ]
    },
    {
      "identifier": "g10_73",
      "text": "As a trainer, I want to be assured that no one can submit the same answers multiple time and skew my results, so that my ratings are accurate.",
      "entities": [
        "Answer",
        "Result"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Assured"
      ]
    },
    {
      "identifier": "g10_74",
      "text": "As a trainer, I want to be notified about the results of surveys about my classes, so that I can read them.",
      "entities": [
        "Survey",
        "Class"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Notified About The Results Of Surveys About Classes"
      ]
    },
    {
      "identifier": "g10_75",
      "text": "As a site admin, I want to see the results for each trainer and averages for the class, so that I can identify any outliers or possible problems.",
      "entities": [
        "Result",
        "Average",
        "Class",
        "Trainer"
      ],
      "personas": [
        "Site Admin"
      ],
      "actions": [
        "See The Results For Average",
        "See The Results For Each Trainer For The Class"
      ]
    },
    {
      "identifier": "g10_76",
      "text": "As a site visitor, I want to see a trainer's rating, so that I choose a course from an appropriate trainer.",
      "entities": [
        "Trainer",
        "Rating"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "See A Trainer's Rating"
      ]
    },
    {
      "identifier": "g10_77",
      "text": "As a trainer, I want to show my rating up on my profile page, so that site visitors can choose wisely.",
      "entities": [
        "Profile Page",
        "Rating"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Show Rating Up On Profile Page"
      ]
    },
    {
      "identifier": "g10_78",
      "text": "As a site visitor, I want to view a section of the website that teaches me the basics of what Scrum is, so that I can learn that quickly.",
      "entities": [
        "Basic",
        "Website"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "View A Section Of The Website Teaches Me The Basics What Scrum Is"
      ]
    },
    {
      "identifier": "g10_79",
      "text": "As a site editor, I want to create the content of the What Is Scrum section, so that it's there for visitors.",
      "entities": [
        "Content"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Create The Content The Is Scrum Section"
      ]
    },
    {
      "identifier": "g10_80",
      "text": "As a site visitor, I want to view lists on the site of all Certified Scrum Masters, Practitioners, Trainers, and Certified Scrum Product Owners.",
      "entities": [
        "Site",
        "Practitioner",
        "Trainer",
        "Product Scrum Owner",
        "Scrum Masters"
      ],
      "personas": [
        "Site Visitor"
      ],
      "actions": [
        "View Lists On The Site Of Certified Product Scrum Owner",
        "View Lists On The Site Of Practitioner",
        "View Lists On The Site Of Trainer",
        "View Lists On The Site Of All Certified Scrum Masters"
      ]
    },
    {
      "identifier": "g10_81",
      "text": "As a CSM, I want to have my name listed in the registry without becoming a member of the site, so that employers or others can verify my certification.",
      "entities": [
        "Registry",
        "Site"
      ],
      "personas": [
        "Csm"
      ],
      "actions": [
        "Have"
      ]
    },
    {
      "identifier": "g10_82",
      "text": "As a trainer, I want to load an Excel file into the site, so that the course participants are added to the Scrum Alliance records.",
      "entities": [
        "Site",
        "Excel File"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Load An Excel File Into The Site"
      ]
    },
    {
      "identifier": "g10_83",
      "text": "As a site admin, I want to view all classes in a pending state, so that I can approve any that need to be approved.",
      "entities": [
        "Class",
        "Pende State"
      ],
      "personas": [
        "Site Admin"
      ],
      "actions": [
        "View All Classes In A Pending State"
      ]
    },
    {
      "identifier": "g10_84",
      "text": "As a site admin, I want to move people in a trainer's class from a pending state to the registry once I have received proof of payment from the trainer.",
      "entities": [
        "Payment",
        "Pende State",
        "People",
        "Trainer",
        "Registry",
        "Class"
      ],
      "personas": [
        "Site Admin"
      ],
      "actions": [
        "Move People In A Trainer's Class From A Pending State To The Registry",
        "Received Proof Of Payment From The Trainer"
      ]
    },
    {
      "identifier": "g10_85",
      "text": "As a CSM, I want to be sent an email welcoming me to the Scrum Alliance and with instructions to register or activate my membership once my name has been loaded to the registry.",
      "entities": [
        "-pron-",
        "Scrum Alliance",
        "Membership",
        "Registry"
      ],
      "personas": [
        "Csm"
      ],
      "actions": [
        "Register Membership",
        "Sent",
        "Welcome Me",
        "Welcome Me With",
        "Welcome To The Scrum Alliance",
        "Name Loaded To The Registry",
        "Activate Membership"
      ]
    },
    {
      "identifier": "g10_86",
      "text": "As a site editor, I want to edit the content of the email automatically sent to new Certified Scrum Masters and Product Owners, so that I don't need to involve a programmer on simple email edits.",
      "entities": [
        "Email",
        "Content",
        "Product Owner",
        "Scrum Masters"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Edit The Content Of The Automatically Email To Product Owner",
        "Edit The Content Of The Automatically Email To Certified, New Scrum Masters"
      ]
    },
    {
      "identifier": "g10_87",
      "text": "As a company, I want to join the Scrum Alliance by paying a corporate membership fee, so that I can show the company's support of Scrum.",
      "entities": [
        "Scrum Alliance",
        "Membership Fee"
      ],
      "personas": [
        "Company"
      ],
      "actions": [
        "Join The Scrum Alliance Paying A Corporate Membership Fee"
      ]
    },
    {
      "identifier": "g10_88",
      "text": "As a corporatesponsor, I want to display my logo on a corporate sponsors page, so that others see the company's support of Scrum.",
      "entities": [
        "Logo",
        "Sponsors Page"
      ],
      "personas": [
        "Corporatesponsor"
      ],
      "actions": [
        "Display Logo On A Corporate Sponsors Page"
      ]
    },
    {
      "identifier": "g10_89",
      "text": "As a corporatesponsor, I want to make my logo randomly appear on the home page, so that others see the company's support of Scrum.",
      "entities": [
        "Logo"
      ],
      "personas": [
        "Corporatesponsor"
      ],
      "actions": [
        "Make"
      ]
    },
    {
      "identifier": "g10_90",
      "text": "As a CSM, I want to be charged a fee once I am approved for Practitioner status, so that my certification status can be activated.",
      "entities": [
        "Fee",
        "Practitioner Status"
      ],
      "personas": [
        "Csm"
      ],
      "actions": [
        "Approved For Practitioner Status",
        "Charged A Fee"
      ]
    },
    {
      "identifier": "g10_91",
      "text": "As a CST, I want to pay an annual fee, so that my CST status is active.",
      "entities": [
        "Annual Fee"
      ],
      "personas": [
        "Cst"
      ],
      "actions": [
        "Pay An Annual Fee"
      ]
    },
    {
      "identifier": "g10_92",
      "text": "As a site administrator, I want to set the annual fees for members, Practitioners and Trainers, so that fees can be set without involving a programmer.",
      "entities": [
        "Annual Fee",
        "Member",
        "Practitioner",
        "Trainer"
      ],
      "personas": [
        "Site Administrator"
      ],
      "actions": [
        "Set The Annual Fees For Members",
        "Set The Annual Fees For Trainer",
        "Set The Annual Fees For Practitioner"
      ]
    },
    {
      "identifier": "g10_93",
      "text": "As a member, I want to receive a reminder and a link, so that I can renew my membership.",
      "entities": [
        "Reminder",
        "Link"
      ],
      "personas": [
        "Member"
      ],
      "actions": [
        "Receive A Reminder",
        "Receive A Link"
      ]
    },
    {
      "identifier": "g10_94",
      "text": "As a member, I want to have the system email me a new password or a password reminder since i have short-term memory problems.",
      "entities": [
        "System",
        "New Password",
        "Term Memory Problems"
      ],
      "personas": [
        "Member"
      ],
      "actions": [
        "The System Email Me A New Password Have Short Term Memory Problems",
        "Have"
      ]
    },
    {
      "identifier": "g10_95",
      "text": "As a trainer, I want to read information of relevance only to trainers, so that the Scrum Alliance can share information with me easily.",
      "entities": [
        "Relevance",
        "Trainer"
      ],
      "personas": [
        "Trainer"
      ],
      "actions": [
        "Read Information Of Relevance Only To Trainers"
      ]
    },
    {
      "identifier": "g10_96",
      "text": "As a site editor, I want to post information in a trainers-only section, so that only trainers see it.",
      "entities": [
        "Trainer Section",
        "Information"
      ],
      "personas": [
        "Site Editor"
      ],
      "actions": [
        "Post Information In A Only Trainers Section"
      ]
    }
  ]
}