{
  "case": "g08",
  "stories": [
    {
      "identifier": "g08_0",
      "text": "As a Developer, I want to get a Data Package into Node, so that I can start using the data for doing analysis and visualizations.",
      "entities": [
        "Data Package",
        "Node"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Get A Data Package Into Node"
      ]
    },
    {
      "identifier": "g08_1",
      "text": "As a Researcher, I want to get a Data Package into Julia in seconds, so that I can start using the data for doing analysis and visualizations. ",
      "entities": [
        "Julia",
        "Second",
        "Data Package"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Get A Data Package Into Julia In Seconds"
      ]
    },
    {
      "identifier": "g08_2",
      "text": "As a Publisher, I want to add type information to my data, so that it is more useful to others and can be used better with tools like visualization programs. ",
      "entities": [
        "Type Information",
        "Datum"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Add Type Information To Data"
      ]
    },
    {
      "identifier": "g08_3",
      "text": "As a Publisher, I want to be able to provide a visualization of data in the Data Package, so that I can provide my analysis and show my work to users of the data. ",
      "entities": [
        "Datum",
        "Data Package"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Provide A Visualization Of Data In The Data Package"
      ]
    },
    {
      "identifier": "g08_4",
      "text": "As a Researcher, I want to be able to save new visualizations, so that I can share them with others or include them in the Data Package. ",
      "entities": [
        "New Visualization"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Save New Visualizations"
      ]
    },
    {
      "identifier": "g08_5",
      "text": "As a ResearcherPublisher, I want to know that my data conforms to its Data Package profile, so that I can feel trust in the validity and usefulness of the data. ",
      "entities": [
        "Data Package Profile"
      ],
      "personas": [
        "Researcherpublisher"
      ],
      "actions": [
        "Conforms To Data Package Profile",
        "Know"
      ]
    },
    {
      "identifier": "g08_6",
      "text": "As a ResearcherPublisher, I want to understand the ways in which my data is invalid, so that I can know how to fix it. ",
      "entities": [
        "Datum",
        "Way"
      ],
      "personas": [
        "Researcherpublisher"
      ],
      "actions": [
        "Understand The Ways In Which Data Is Invalid"
      ]
    },
    {
      "identifier": "g08_7",
      "text": "As a Researcher, I want to get a Data Package into R in seconds, so that I can start using the data for doing analysis and visualizations. ",
      "entities": [
        "R",
        "Data Package",
        "Second"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Get A Data Package Into R In Seconds"
      ]
    },
    {
      "identifier": "g08_8",
      "text": "As a Researcher, I want to get a Data Package into Excel in seconds, so that I can start using the data for doing analysis and visualizations. ",
      "entities": [
        "Excel",
        "Second",
        "Data Package"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Get A Data Package Into Excel In Seconds"
      ]
    },
    {
      "identifier": "g08_9",
      "text": "As a Researcher, I want to get a Data Package into SPSS in seconds, so that I can start using the data for doing analysis and visualizations. ",
      "entities": [
        "Spss",
        "Second",
        "Data Package"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Get A Data Package Into Spss In Seconds"
      ]
    },
    {
      "identifier": "g08_10",
      "text": "As a Researcher, I want to get a Data Package into STATA in seconds, so that I can start using the data for doing analysis and visualizations. ",
      "entities": [
        "Stata",
        "Data Package",
        "Second"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Get A Data Package Into Stata In Seconds"
      ]
    },
    {
      "identifier": "g08_11",
      "text": "As a Researcher, I want to be able to translate my EML dataset to a Data Package, so that I can benefit from the wide array of tools available for Data Packages. ",
      "entities": [
        "Eml Dataset",
        "Data Package"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Translate Eml Dataset To A Data Package"
      ]
    },
    {
      "identifier": "g08_12",
      "text": "As a Researcher, I want to get a Data Package into LibreOffice/OpenOffice in seconds, so that I can start using the data for doing analysis and visualizations. ",
      "entities": [
        "Second",
        "Libreoffice",
        "Package",
        "Openoffice",
        "Data"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Get A Data Package Into Libreoffice In Seconds",
        "Get A Package Into Openoffice"
      ]
    },
    {
      "identifier": "g08_13",
      "text": "As a Developer, I want to get a Data Package into Python in seconds, so that I can start using the data for doing analysis and visualizations. ",
      "entities": [
        "Second",
        "Data Package",
        "Python"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Get A Data Package Into Python In Seconds"
      ]
    },
    {
      "identifier": "g08_14",
      "text": "As a Developer, I want a jQuery plugin for Core Data Packages, so that I can use it to apply to form control that uses a core dataset for autocompletion. ",
      "entities": [
        "Jquery Plugin",
        "Core Data Packages"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With A Jquery Plugin For Core Data Packages"
      ]
    },
    {
      "identifier": "g08_15",
      "text": "As a Researcher, I want to get my Excel spreadsheet into a Data Package, so that I can benefit from better tooling and standardization. ",
      "entities": [
        "Excel Spreadsheet",
        "Data Package"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Get Excel Spreadsheet Into A Data Package"
      ]
    },
    {
      "identifier": "g08_16",
      "text": "As a Developer, I want to do exploratory data analysis in R and operationalize that analysis in Python, so that I can use the best tool for the job.",
      "entities": [
        "R",
        "Analysis",
        "Python",
        "Data"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Do Exploratory Data Analysis In R",
        "Operationalize That Analysis In Python"
      ]
    },
    {
      "identifier": "g08_17",
      "text": "As a Developer, I want to get a Data Package into Clojure in seconds, so that I can start using the data in doing analysis and visualizations. ",
      "entities": [
        "Data Package",
        "Clojure",
        "Second"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Get A Data Package Into Clojure In Seconds"
      ]
    },
    {
      "identifier": "g08_18",
      "text": "As a Developer, I want to get a Data Package into Julia in seconds, so that I can start using the data in doing analysis and visualizations. ",
      "entities": [
        "Second",
        "Julia",
        "Data Package"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Get A Data Package Into Julia In Seconds"
      ]
    },
    {
      "identifier": "g08_19",
      "text": "As a Developer, I want to get a Data Package into C++ in seconds, so that I can start using the data in doing analysis and visualizations. ",
      "entities": [
        "C++",
        "Second",
        "Data Package"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Get A Data Package Into C++ In Seconds"
      ]
    },
    {
      "identifier": "g08_20",
      "text": "As a Machine Learning expert, I would like to package ML datasets as data packages, so that I can easily import them into my ML platform, so that I can start using the data in doing analysis. ",
      "entities": [
        "Ml Datasets"
      ],
      "personas": [
        "Machine , Learning Expert"
      ],
      "actions": [
        "Package Ml Datasets As Data Packages"
      ]
    },
    {
      "identifier": "g08_21",
      "text": "As a Developer, I want an Elasticsearch integration, so that I can integrate data-packaged data with pipelines that use Elasticsearch. ",
      "entities": [
        "Elasticsearch Integration"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With An Elasticsearch Integration"
      ]
    },
    {
      "identifier": "g08_22",
      "text": "As a Developer, I want an SPSS integration, so that I can integrate data-packaged data with pipelines that use SPSS. ",
      "entities": [
        "Spss Integration"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With An Spss Integration"
      ]
    },
    {
      "identifier": "g08_23",
      "text": "As a Developer, I want an EPrints integration, so that I can integrate data-packaged data with pipelines that use EPrints. ",
      "entities": [
        "Eprints Integration"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With An Eprints Integration"
      ]
    },
    {
      "identifier": "g08_24",
      "text": "As a Developer, I want a Mongo integration, so that I can integrate data-packaged data with pipelines that use Mongo. ",
      "entities": [
        "Mongo Integration"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With A Mongo Integration"
      ]
    },
    {
      "identifier": "g08_25",
      "text": "As a Developer, I want a DAT integration, so that I can integrate data-packaged data with pipelines that use DAT. ",
      "entities": [
        "Dat Integration"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With A Dat Integration"
      ]
    },
    {
      "identifier": "g08_26",
      "text": "As a ResearcherGovernment Publisher, I want to add general reference data to my narrow dataset, so that my dataset is more useful. ",
      "entities": [
        "Narrow Dataset",
        "Reference Data"
      ],
      "personas": [
        "Researchergovernment Publisher"
      ],
      "actions": [
        "Add General Reference Data To Narrow Dataset"
      ]
    },
    {
      "identifier": "g08_27",
      "text": "As a ResearcherGovernment Publisher, I want to add general country names to my dataset that only contains country codes, so that my dataset is more readable. ",
      "entities": [
        "Country Codes",
        "Dataset",
        "Country Names"
      ],
      "personas": [
        "Researchergovernment Publisher"
      ],
      "actions": [
        "Add General Country Names To Dataset Only Contains Country Codes"
      ]
    },
    {
      "identifier": "g08_28",
      "text": "As a ResearcherGovernment Publisher, I want to add reference data on inflation to my spending dataset, so that the spending lines in my dataset is more understandable. ",
      "entities": [
        "Spending Dataset",
        "Inflation",
        "Reference Data"
      ],
      "personas": [
        "Researchergovernment Publisher"
      ],
      "actions": [
        "Add Reference Data On Inflation To Spending Dataset"
      ]
    },
    {
      "identifier": "g08_29",
      "text": "As a ResearcherGovernment Publisher, I want to map lines in my dataset using geographic data in my dataset, so that my dataset is more engaging for non-technical users. ",
      "entities": [
        "Geographic Datum",
        "Dataset",
        "Line"
      ],
      "personas": [
        "Researchergovernment Publisher"
      ],
      "actions": [
        "Map Lines In Dataset Using Geographic Data In Dataset"
      ]
    },
    {
      "identifier": "g08_30",
      "text": "As a Researcher, I want to be able to reference a remote-controlled vocabulary for my dataset, so that I can be sure that column of my dataset are valid against a single shared list of terms. ",
      "entities": [
        "Dataset",
        "Control Vocabulary"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Reference A Remote Controlled Vocabulary For Dataset"
      ]
    },
    {
      "identifier": "g08_31",
      "text": "As a developer, I want an DSpace integration, so that I can integrate data-packaged data with pipelines that use Dspace. ",
      "entities": [
        "Dspace Integration"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With An Dspace Integration"
      ]
    },
    {
      "identifier": "g08_32",
      "text": "As a Developer, I want Feather integration, so that I can integrate data-packaged data with pipelines that use Feather. ",
      "entities": [
        "Feather Integration"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With Feather Integration"
      ]
    },
    {
      "identifier": "g08_33",
      "text": "As a Developer, I want HDF5 integration, so that I can integrate data-packaged data with pipelines that use HDF5.",
      "entities": [
        "Hdf5 Integration"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Provided With Hdf5 Integration"
      ]
    },
    {
      "identifier": "g08_35",
      "text": "As a Researcher, working with data, I want an Microsoft Power BI integration, so that I can import datasets without downloading them locally. ",
      "entities": [
        "Integration",
        "Zenodo"
      ],
      "personas": [
        "Researcherpublisher"
      ],
      "actions": [
        "Provided With An Integration With Zenodo"
      ]
    },
    {
      "identifier": "g08_36",
      "text": "As a ResearcherPublisher, I want an integration with Zenodo, so that when I store my dataset in GitHub, I don't have to retype descriptive information about my dataset. ",
      "entities": [
        "Integration",
        "Open Refine"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Provided With An Integration With Open Refine"
      ]
    },
    {
      "identifier": "g08_37",
      "text": "As a Publisher, I would like an integration with Open Refine, so that I can output cleaned Data Packages. ",
      "entities": [
        "Ckan",
        "Data Packages"
      ],
      "personas": [
        "Researcherpublisher"
      ],
      "actions": [
        "Publish Data Packages To Ckan"
      ]
    },
    {
      "identifier": "g08_40",
      "text": "As a ResearcherDeveloper, would like the ability import/export from MS-SQL, so that I can use Data Packages in workflows that involve MS-SQL. ",
      "entities": [
        "Https",
        "Data . Mendeley . Com",
        "Integration"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Provided With An Integration With Https",
        "Provided With Data.Mendeley.Com"
      ]
    },
    {
      "identifier": "g08_41",
      "text": "As a Researcher, working with data in NetCDF, I want NetCDF integration, so that I can store my data in plaintext while still retaining its metadata. ",
      "entities": [
        "Integration",
        "Excel"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Provided With An Integration With Excel"
      ]
    },
    {
      "identifier": "g08_42",
      "text": "As a Researcher, I want an integration with https://data.mendeley.com/, so that I can validate my data upon ingest to the service.",
      "entities": [
        "Datum"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Online Store Data"
      ]
    },
    {
      "identifier": "g08_43",
      "text": "As a Publisher, I would like an integration with Excel, so that I can output cleaned Data Packages. ",
      "entities": [
        "Research Data",
        "Tool",
        "Basic Metadata",
        "Researcher",
        "User"
      ],
      "personas": [
        "Repository Manager"
      ],
      "actions": [
        "Researchers Add Basic Metadata To Research Data",
        "User Add"
      ]
    },
    {
      "identifier": "g08_44",
      "text": "As a Publisher, I want to store my data quickly and easily online. ",
      "entities": [
        "Click",
        "Datum"
      ],
      "personas": [
        "Researcherpublisher"
      ],
      "actions": [
        "Provided Validate Data With A Minimum Of Clicks"
      ]
    },
    {
      "identifier": "g08_45",
      "text": "As a Repository Manager, I want a tool that makes it easy for researchers/ users to add basic metadata to their research data, so that it is more findable and therefore useful. ",
      "entities": [
        "Datum"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Time Check Good",
        "Update Data"
      ]
    },
    {
      "identifier": "g08_46",
      "text": "As a ResearcherPublisher, I want validate my data with a minimum of clicks, so that I can feel trust in the validity and usefulness of the data. ",
      "entities": [
        "Datum",
        "Command Line Tool"
      ],
      "personas": [
        "Developerwrangler"
      ],
      "actions": [
        "Validate Data",
        "Use A Command Line Tool Allows"
      ]
    },
    {
      "identifier": "g08_48",
      "text": "As a DeveloperWrangler, I want to use a command line tool that allows me to validate data, so that I can feel trust in the validity and usefulness of the data quickly and in the context of my command line workflow. ",
      "entities": [
        "Publish Datum"
      ],
      "personas": [
        "Government Publisher"
      ],
      "actions": [
        "Make",
        "Prove Published Data Valid"
      ]
    },
    {
      "identifier": "g08_49",
      "text": "As a developer, I want an online service that is connected to my data repository that validates data on update, so that I can delegate data validation to a third party. ",
      "entities": [
        "Government",
        "Datum"
      ],
      "personas": [
        "Civic , Tech Activist"
      ],
      "actions": [
        "Make",
        "Assess The Quality Of Data The Government"
      ]
    },
    {
      "identifier": "g08_50",
      "text": "As a government Publisher, I want to make it easy to prove that our published data is valid, so that I can claim that we are living up to our transparency commitments. ",
      "entities": [
        "Site",
        "Datum"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Embed An Interactive Preview Of Data On Site"
      ]
    },
    {
      "identifier": "g08_51",
      "text": "As a Civic Tech Activist, I want to make it easy to assess the quality of data stored by the government, so that I can make sure that government is living up to its transparency commitments. ",
      "entities": [
        "Site",
        "Preview Button"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Embed A Preview Button On Site"
      ]
    },
    {
      "identifier": "g08_52",
      "text": "As a publisher, I want to embed an interactive preview of my data on my site, so that users can be encouraged that this is the correct data for them. ",
      "entities": [
        "Dataset",
        "User"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Know"
      ]
    },
    {
      "identifier": "g08_53",
      "text": "As a publisher, I want to embed a preview button on my site, so that users can preview the data and be encouraged that this is the correct data for them.",
      "entities": [
        "Datum",
        "Exist Wizard"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Customize An Existing Wizard For Specific Type Of Data"
      ]
    },
    {
      "identifier": "g08_54",
      "text": "As a Publisher, I want to know how many users have previewed a dataset, so that I know how interest in a dataset relates to its actual download numbers. ",
      "entities": [
        "Useful Metadata",
        "Dataset",
        "Data Columns"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Add Useful Metadata",
        "Add In New Data Columns",
        "Make The Dataset"
      ]
    },
    {
      "identifier": "g08_55",
      "text": "As a Developer, I want to customize an existing wizard for my specific type of data, so that I can give my users a great user experience.",
      "entities": [
        "Methodology",
        "Reproducible Step",
        "Data State"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Get A Certain Data State",
        "Package Reproducible Steps"
      ]
    },
    {
      "identifier": "g08_56",
      "text": "As a Publisher, I want to add useful metadata or add in new data columns to make the dataset more useful. ",
      "entities": [
        "Github",
        "Data Package",
        "Ckan"
      ],
      "personas": [
        "Developerdatawrangler"
      ],
      "actions": [
        "Store Data Package In Github",
        "Have"
      ]
    },
    {
      "identifier": "g08_57",
      "text": "As a publisher, I want to package reproducible steps to get a certain data state, so my methodology is transparent and can be rerun by others. ",
      "entities": [
        "Tool",
        "Dataset",
        "Basic Statistic"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Provided With A Tool Generate Basic Statistics About A Dataset"
      ]
    },
    {
      "identifier": "g08_58",
      "text": "As a DeveloperDataWrangler, I want to store my Data Package in GitHub and have it automatically stored into CKAN, so that I get a data API and my dataset is listed in a relevant catalog. ",
      "entities": [
        "Iframe",
        "Data Summary"
      ],
      "personas": [
        "Developerpublisher"
      ],
      "actions": [
        "Create An Embeddable Data Summary Via Iframe"
      ]
    },
    {
      "identifier": "g08_59",
      "text": "As a Researcher, I want a tool that can generate basic statistics about a dataset, so that I can get a quick preview of the data. ",
      "entities": [
        "App",
        "Openrefine Reconciliation Api",
        "Data Package"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Provided With An App Generates An Openrefine Reconciliation Api"
      ]
    },
    {
      "identifier": "g08_60",
      "text": "As a DeveloperPublisher, I want a tool to create an embeddable data summary via iframe, so that I can embed data summaries across sites. ",
      "entities": [
        "Proxy Package",
        "Reliable",
        "App",
        "Know , Data Source",
        "Data Packages"
      ],
      "personas": [
        "Researcher"
      ],
      "actions": [
        "Provided With An App Create Proxy Packages For Reliable",
        "Provided With An App Create Proxy Data Packages For Well Know, Data Sources"
      ]
    },
    {
      "identifier": "g08_61",
      "text": "As a Researcher, I want an app that generates an OpenRefine reconciliation API endpoint from a Tabular Data Package, so that I can use it to clean messy data. ",
      "entities": [
        "Match , Service",
        "Packaging Data",
        "App"
      ],
      "personas": [
        "Repositorymanagerresearcher"
      ],
      "actions": [
        "Provided With An App Acts As A Match, Making Service For Packaging Data"
      ]
    },
    {
      "identifier": "g08_62",
      "text": "As a Researcher, I want an app that create proxy Data Packages for well know and reliable data, sources, so that I can load high quality data using Data Package tooling. ",
      "entities": [
        "Web Socket Protocol",
        "Data Tools"
      ],
      "personas": [
        "Developer"
      ],
      "actions": [
        "Create A Web Socket Protocol For Frictionless Data Tools"
      ]
    },
    {
      "identifier": "g08_63",
      "text": "As a RepositoryManagerResearcher, I want an app that acts as a match-making service for packaging data, so that owners are paired with data packagers. ",
      "entities": [
        "Publication",
        "Data Availability Persistence"
      ],
      "personas": [
        "Publisher"
      ],
      "actions": [
        "Check Data Availability Persistence After Publication"
      ]
    },
    {
      "identifier": "g08_64",
      "text": "As a developer, I would like to create a web socket protocol for Frictionless data tools, so that I can easily use data packages with additional data analysis tools. ",
      "entities": [
        "Funding",
        "Dataset"
      ],
      "personas": [
        "Researcherpublisher"
      ],
      "actions": [
        "Specify The Funding Contributed To The Creation Of A Given Dataset"
      ]
    },
    {
      "identifier": "g08_65",
      "text": "As a Publisher, I would like a tool to check data availability persistence after publication. ",
      "entities": [
        "Doi",
        "Dataset"
      ],
      "personas": [
        "Researcherpublisher"
      ],
      "actions": [
        "Add A Doi To A Dataset"
      ]
    }
  ]
}